Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ལ་ གང་ གིས་ ཀྱང་ མི་ དགའ་བ འམ །_ ཡིད་ དུ་ མི་ འོང་བ་ ཉེ་བ ར་ བསྒྲུབ་པ ར་ གྱུར་ ན་ མི་ རུང་ ངོ་ སྙམ་ ནས །_
en: ‘It is not right that Prince Puṇyottama feels so unhappy and depressed with everything.

source: གང་ གིས་ རྩེ་བ ར་ མི་ བྱེད་ དགའ་བ ར་ མི་ བྱེད །_ |#| དགའ་མགུ ར་ སྤྱོད་པ ར་ མི་ བྱེད་ ཅིང་ །_ བུད་མེད་ མཐོང་ ན འང་ སྒོ་ གཅོད་པ ར་ བྱེད་ ཅེས་ དེ་ བདག་ གིས་ གདོན་ མི་ ཟ་བ ར་ དྲི་བ ར་ བྱ འོ་ སྙམ་ མོ །_།
en: We must by all means inquire into why he is not dallying, enjoying himself, or celebrating, but shuts his door whenever he sees a girl.’

source: དེ་ནས་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ དང་ །_ སྐྱེ་དགུ འི་ བདག་མོ་ གཙོ་ མོ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ ཕྱིན་ ནས །_ |#| རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སྨྲས་པ །_
en: King Vīradatta and his main wife then went before Prince Puṇyottama and spoke to him the following verses:

source: ཁང་ བཟངས་ ཆོས་ དང་ ཆོས་ བཟངས་ བྱེད་ དུ་ བཅུག _། |#| དེ་བཞིན་ ལྷ་ ཡི་ བུ་མོ་ འདྲ་བ ས་ གང་ །_། ཤིང་ ལྗོན་ སྣ་ཚོགས་ སྐྱེད་མོས་ཚལ་ མཛེས་ ན །_།
en: $1018 “ ‘Here in the Dharma palace and the Dharmabhadra garden, So filled with heavenly girls, And its parks adorned with a variety of trees,

source: ཅི་ཕྱིར་ གཞོན་ནུ་ ཁྱིམ་ དེར་ དགའ་ མི་ བྱེད །_།
en: Why, Prince, do you not take pleasure in your home?

source: ཁང་ བཟངས་ དང་ ནི་ ཤིང་ཐགས་ དམ་པོ་ བཙུགས །_། རྒྱལ་སྲིད་ ཀུན་ ལ་ གྲོང་ཁྱེར་ འདི་ བྱེད་ བཅུག _། |#| འདིར་ ནི་ འཛམ་གླིང་ འདི་ ཀུན་སྣང་ འགྱུར་ ན །_།
en: $1019 “ ‘Here in the palace with its wooden spires, In this city that extends throughout the kingdom, And that illuminates this Jambudvīpa,

source: དེ་རིང་ ཁྱོད་ ལ་ སུ་ ཡིས་ མི་ དགའ་ སྨྲས །_།
en: $1020 “ ‘Has anyone spoken unpleasantly to you today?

source: ཁྱོད་ ལ་ མི་ སྙན་ དེ་ འདྲ་ ག་ལ ས་ [126a] བྱུང་ །_།
en: From where did you incur such unpleasantness? [126.a]

source: ཚོང་པ་ ནོར་ རྙེད་ ཆེན་པོ་ ཆུད་ ཟོས་ བཞིན །_། ཅི་ཕྱིར་ འདི་ ན་ ཁྱོད་ ནི་ གཅིག་པུ་ སེམས །_།
en: Why do you ponder on only this, Like a merchant who has squandered his fortune?

source: ང་ ནི་ ཕ་ ཡིན་ འདི་ ཡང་ མ་ ཡིན་ གྱིས །_། གང་དེ་ དྲིས་པ་ ངེད་ ལ་ སྨྲ་བ ར་ གྱིས །_།
en: $1021 “ ‘I am your father, and this your mother. |#| Please answer our questions!

source: འཛམ་གླིང་ དབང་ཕྱུག་ ད་ལྟ་ ང་ ཡིན་ ན
en: Since I am now the lord of Jambudvīpa,

source: དེང་ འདིར་ ཆད་པ་ ཆེན་པོ་ སུ་ ལ་ གཅད །_།
en: I will promptly impose a severe penalty on whomever’s responsible.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ནས་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ གིས་ ཕ་མ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སླར་ སྨྲས་པ །_
en: $1022 “Śāradvatī­putra, Prince Puṇyottama responded to his parents with these verses:

source: བདག་ ལ་ སུ ས་ ཀྱང་ མི་ སྙན་ སྨྲས་ མ་ མཆིས །_།
en: “ ‘No one at all has spoken to me unpleasantly.

source: ཚིག་མ་ མཆིས་པ ས་ ཇི་ལྟ ར་ བརྗོད་པ ར་ བགྱི །_།
en: Since there have been no such words, How can I inform you?

source: སུ་ ལ འང་ ཁྱེད་ ཀྱིས་ ཆད་པ་ མི་ གཅད་ གསོལ །_།
en: Please do not punish anyone at all!

source: !རང་ གིས་ སེམས་ ལ་ ཆད་པ་ གཅད་པ ར་ མཛོད །_།
en: $1023 “ ‘Punish my own#46 mind!

source: ཆུ་ ཡི་ ནང་ འདིར་ བདག་ ནི་ སྤྱོད་པ་ ན །_།
en: When I was coursing in the water here,

source: བདག་ གིས་ འདྲེན་པ་ ཡི་ ནི་ སྐུ་ མཐོང་ སྟེ །_། |#| འཛམ་གླིང་ གསེར་ གྱི་ འོད་ཟེར་ བྱེ་ སྟོང་ ལྡན །_།
en: I saw the sublime body of a guide, Radiating billions of golden light rays throughout Jambudvīpa.

source: ཕྱོགས་ ཉིད་ ཀུན་ ཏུ་ སྣང་ ཞིང་ རྣམ་པར་ མཛེས །_། |#| ས་ ཡི་ འོད་ དང་ དེ་བཞིན་ མེ་ ཡི་ འོད །_། ཟླ་ བ འི་ འོད་ དང་ དེ་བཞིན་ ཉི་མ འི་ འོད །_། དེ་ ཡི་ གན་ ན་ ཐམས་ཅད་ མི་ གདའ་ སྟེ །_།
en: $1024 “ ‘He illuminated everything and was so beautiful That the light of the ground, the light of fire, The light of the moon, and the light of the sun Were all eclipsed in his presence.

source: དེ་ འདྲ འི་ སྐུ་ དེ་ མཐོང་བ ར་ གྱུར་ ཏོ་ ཡབ །_། བདག་ སེམས་ ཡེ་ཤེས་ གཟུགས་ ཀྱིས་ ཇི་ལྟ་བུ ར །_། སྐུ་ དེ་དེ་ འདྲ་ བདག་ ཀྱང་ གྱུར་ཅིག་ སྙམ །_།
en: $1025 “ ‘I saw such a sublime body as that, Father, And thought, “By my mind assuming the form of wisdom, May I become exactly like that sublime body!”

source: རྒ་ ནད་ གཟིར་བ འི་ སེམས་ཅན་ ཐར་བ ར་ བགྱི །_།
en: I will free beings from the afflictions of old age and illness!

source: ཉོན་ མོངས་ སེམས་ ལྡན་ བདེ་ དང་ ལྡན་པ ར་ བགྱི །_།
en: $1026 “ ‘I will bring joy to those with afflicted minds!

source: ཡེ་ཤེས་ གཟུགས་ དང་ སྟོབས་ དང་ མཐུ་ དང་ ནི །_། བསམ་ མི་ ཁྱབ་པ ས་ སྐུ་ དེ་ ཅི་ ལྟ་བ ར །_། མི་ རྣམས་ ཀྱི་ ནི་ རྒྱ་ ཆེན་ དོན་ བགྱི་ ཞིང་ །_།
en: In that very wisdom body, With its strength, power, and inconceivable nature, I will enact vast benefit for people.

source: ངན་འགྲོ་ གནས་པ འི་ སྐྱེ་བོ་ གདོན་པ ར་ བགྱི །_།
en: $1027 “ ‘I will free beings from dwelling in the lower realms!

source: བདག་ ནི་ རྩེས་ པས་ འཚལ་ ཏོ་ དགའ་བ ས་ འཚལ །_།
en: I have indulged in dallying and pleasures!

source: ཁྱིམ་ དང་ བུད་མེད་ དག་ གིས་ འཚལ་ ལགས་སོ །_།
en: I have indulged in household and girls!

source: བདག་ གིས་ ཀུན་སྤངས་ རབ་ཏུ་ འབྱུང་བ ར་ བགྱི །_།
en: I will renounce it all and go forth!

source: སངས་རྒྱས་ རྣམས་ ཀྱིས་ བསླབས་ ནས་ སངས་རྒྱས་ བགྱི །_།
en: $1028 “ ‘I will be trained by the buddhas and become awakened!

source: ངུར་སྨྲིག་ གི་ ནི་ གོས་ ཀྱང་ བགོས་ ནས་ སུ །_། རབ་ཏུ་ བྱུང་ ནས་ བདག་ གིས་ ཆོས་ སྤྱད་ དོ །_།
en: Donning the ochre robes, I will go forth and practice the Dharma.

source: ཡབ་ ཅིག་ ཁྱོད་ ཀྱང་ འདིར་ ནི་ རབ་བྱུང་ ནས །_།
en: $1029 ‘Father, you too should go forth!

source: རྒྱལ་སྲིད་ སྤོངས་ ཏེ་ ཆོས་ ལ་ སྤྱོད་པ ར་ མཛོད །_།
en: Renounce the kingdom and practice the Dharma!

source: རྟག་ ཏུ་ བདག་ གིས་ ཆོས་ ནི་ བཙལ་བ ར་ བགྱི །_།
en: I will constantly pursue the Dharma!

source: རྟག་ ཏུ་ བདག་ གིས་ ཚུལ་བཞིན་ ཆོས་ སྤྱད་ དོ །_།
en: I will constantly practice the Dharma properly!

source: འདོད་པ་ བསྟེན་པ ས་ བདེ་ལེགས་ འགྱུར་ མ་ ལགས །_།
en: $1030 “ ‘Happiness does not come from indulging in desire.

source: དཀར་པོ་ ཐམས་ཅད་ ཉམས་པ ར་ འགྱུར་བ་ ལགས །_། [126b]
en: Rather, it will diminish everything wholesome. [126.b]

source: ཡབ་ ཅིག་ འདོད་ འཆིང་ འདི་ ནི་ དམ་པོ་ ལགས །_།
en: Dear Father, the fetters of desire are tight.

source: དེ་ སླད་ ཁྱོད་ ནི་ བཅིངས་ ལས་ ཐར་ མི་ འགྱུར །_།
en: Hereafter, you will not be free from its bonds.

source: འདོད་པ་ སྤོང་ མཛོད་ དགོན་པ ར་ གནས་པ ར་ མཛོད །_།
en: $1031 “ ‘Renounce desire and dwell in the forest!

source: དེ་ལས་ སངས་རྒྱས་ ཡེ་ཤེས་ ཐོབ་པ ར་ འགྱུར །_།
en: Thereby you will attain the wisdom of awakening.

source: སངས་རྒྱས་ བསྟན་པ་ འདི་ ལ་ མངོན་ བྱུང་བ །_། བདག་ ལ་ དེ་རིང་ བར་ཆད་ སུ་ བགྱིད་པ །_། དེ་ ལ་ ནམ་ དུའང་ བདེ་ལེགས་ མི་ འགྱུར་ ཡབ །_། བསོད་ནམས་ མ་ ལགས་ མང་པོ་ ཐོབ་པ ར་ འགྱུར །_།
en: There will never be any happiness, Father, For he who prevents me today |#| $1032 “ ‘From going forth in the teaching of the Buddha— Rather, doing so will incur great fault!

source: ཡབ་ ཅིག་ ཁྱོད་ ལ་སྨན་ སླད་ བདག་ གིས་ བརྗོད །_།
en: Dear Father, I say this for your benefit.

source: ཁྱོད་ ལ་ རྒྱལ་སྲིད་ ཅི་ བགྱི་ སྲས་ ཅི་ བགྱི །_།
en: What good is the kingdom, what good to you a son?

source: རྒྱལ་སྲིད་ མི་རྟག་ ལོངས་སྤྱོད་ རྟག་ མ་ ལགས །_།
en: $1033 “ ‘The kingdom is impermanent, as are enjoyments—

source: ཁྱོད་ དང་ རིང་པོ ར་ མི་ ཐོགས་ འབྲལ་བ ར་ འགྱུར །_།
en: You will part with them before long.

source: གང་ ལས་ ཆོས་ དཀར་ མང་པོ་ དེ་ འཐོབ་པ འི །_། ཆོས་ ནི་ གལ་ཏེ་ མ་ བགྱིས་ གྱུར་ ན་ ཡབ །_།
en: If you do not practice the Dharma, From which so many positive qualities are gained,

source: འཁོར་བ འི་ འཁོར་ལོ་ རྗེས་སུ་ འཇུག་པ་ ཡིན །_།
en: $1034 “ ‘You will continue to be immersed in the cycle of saṃsāra,

source: ཡང་ དང་ ཡང་ དུ་ སྐྱེ་ རྒ་ ཉེ་བ ར་ འབྱུང་ །_།
en: To be born and age, again and again.

source: དེ་ ན་ བུ་ ནི་ ནམ་ཡང་ མ་ མཆིས་ ཏེ །_།
en: There never existed a son there,

source: ཆོས་ རྣམས་ དེ་དག་ ཐམས་ཅད་ སྟོང་པ འོ་ ཡབ །_།
en: For all those phenomena are empty, Father.

source: སྟོང་པ འི་ ཆོས་ རྣམས་ དེ་དག་ མི་ རྟོག་པ །_། དེ་དག་ མིང་ དང་ གཟུགས་ ལ་ དམ་པོ ར་ གནས །_།
en: $1035 “ ‘Those who do not reflect on phenomena as empty Adhere strictly to name and form.

source: བུ་ ལ་ སྲེད་ ཕྱིར་ སྡིག་པ་ མ་ མཛད་ ཅིག _།
en: Do not commit negative deeds out of craving for a son!

source: སངས་རྒྱས་ བསྟན་ འདིར་ ཡོངས་སུ་ རབ་ཏུ་ འབྱུང་ །_།
en: I am going forth in the teaching of the Buddha.

source: དལ་བ་ ཕུན་ཚོགས་ བདག་ གིས་ ཡུན་རིང་ རྙེད །_།
en: $1036 “ ‘I will obtain perfect leisure for a long time.

source: ཡབ་ ཅིག་ ཁྱོད་ ཀྱང་ མྱུར་ དུ་ རབ་ཏུ་ བྱུང་ །_།
en: Dear Father, you too should immediately go forth—

source: མི་ ཡི་ ལུས་ འདི་ རབ་ཏུ་ རྙེད་པ ར་ གྱུར །_། |#| བདེ་བ འི་ དབང་ཕྱུག་ སངས་རྒྱས་ འབྱུང་བ ར་ གྱུར །_།
en: You will obtain this human body, And become a buddha, a lord of bliss.

source: བདག་ གིས་ དད་པ་ རིང་ ནས་ དེ་རིང་ རྙེད །_།
en: $1037 “ ‘Today I have gained a deep faith.

source: ཀྱེ་མ་ ཡབ་ ཅིག་ ཚུར་སྤྱོན་ མངོན་པར་ འབྱུང་ །_།
en: Alas, dear Father, come with me and go forth!’

source: དེ་ལྟ ར་ དེ་སྐད་ ཅེས་ སྨྲས་ ནས །_
en: $1038 “Having thus spoken,

source: རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_ |#| ལན་ གསུམ་ བསྐོར་བ་ བྱས་ ནས་ སྤྱན་སྔ ར་ འདུག་ སྟེ །_
en: Prince Puṇyottama went to where the thus-gone one, the worthy one, the perfect buddha Sukharāja was staying, bowed to his feet, circumambulated him three times, and sat before him.

source: ཐལ་མོ་ སྦྱར་ ནས་ ཚིགས་ སུ་ བཅད་ དེ་ གསོལ་པ །_
en: With palms joined, he then spoke the following verses:

source: བདག་ ནི་ བདུད་ ཀྱི་ ཞགས་པ ར་ སྐྱེས་ ལགས་ ཏེ །_།
en: $1039 “ ‘I was born in the noose of Māra.

source: བདག་ ནི་ བདུད་ ཀྱི་ སྤྱོད་ཡུལ་ འཕེལ་ ལགས་སོ །_།
en: I have fomented the experiences of Māra.

source: བདག་ ནི་ བདུད་ ཀྱི་ ཞགས་པ་ ཀུན་ བཅད་ དེ །_། |#| མགོན་པོ་ ཁྱོད་ ལ་ རབ་ཏུ་ འབྱུང་བ ར་ གསོལ །_།
en: I beg you, Lord, to sever the noose of Māra, And allow me to go forth.

source: མགོན་པོ་ བདག་ བཅིང་བ་ ཡིས་ བཅིངས་ [127a] པ་ དམ །_།
en: $1040 “ ‘Protector, I am tightly bound by fetters. [127.a]

source: འཇིགས་པ་ ཆེན་པོ ས་ བཅིངས་ ན་ གཟིགས་ སུ་ གསོལ །_།
en: Bound by great fear, I beg you to look after me!

source: འདི་ ལ་ བདེ་བ འི་ རོ་མྱང་ མ་ མཆིས་ ཏེ །_།
en: There is no taste of joy here;

source: འདོད་པ་ སྡུག་བསྔལ་ ཀུན་ གྱི་ རྩ་བ་ ལགས །_།
en: Desire is the root of all pain.

source: བཅིང་བ་ དེ་དག་ བཅད་ དེ་ འདིར་ བདག་ མཆིས །_།
en: $1041 “ ‘I have come here having cut through those bonds.

source: དེ་ ཚེ་ བདུད་ ཀྱི་ བཅིང་བ་ ཀུན་སྤངས་ ནས །_།
en: And now, having cast off all those fetters of Māra,

source: སངས་རྒྱས་ བསྟན་ འདིར་ རབ་ཏུ་ འབྱུང་བ ར་ འཚལ །_། |#| རྐང་ གཉིས་ རྣམས་ ཀྱི་ དམ་པ་ སངས་རྒྱས་ བགྱི །_།
en: I wish to go forth in the Buddha’s teaching And become a buddha, the best of humans.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོས་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་རབ་ ཏུ་ བྱུང་ ངོ་ །_།
en: $1042 “Śāradvatī­putra, then the thus-gone one, the worthy one, the perfect buddha Sukharāja allowed Prince Puṇyottama to go forth.

source: དེ་ རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས །_
en: Knowing that he had gone forth,

source: རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ གི་ རྗེས་སུ་ སློབ་པ་ སྲོག་ཆགས་ དཀྲིགས་ ཕྲག་ བརྒྱད་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: eight trillion beings went forth in emulation of Prince Puṇyottama.

source: དེ་དག་ རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས །_
en: Knowing that those beings had gone forth,

source: རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ གི་ སླས་ ཀྱང་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: Prince Puṇyottama’s harem also went forth.

source: རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ གི་ གྲོགས་པོ་ བྱེ་བ་ ཕྲག་ བརྒྱ་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: one billion of Prince Puṇyottama’s friends also went forth.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ནས་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱིས་ བུ་ དེ་ རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས །_ |#| དཔུང་ གི་ ཚོགས་ ཡན་ལག་ བཞི་པ་ དང་ ལྷན་ཅིག་ ཏུ་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_
en: $1043 “Śāradvatī­putra, then King Vīradatta, learning that his son had gone forth, went accompanied by his fourfold army before the thus-gone one Sukharāja, bowed to his feet, and

source: ཐལ་མོ་ སྦྱར་ ནས་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གསོལ་ ཏོ །_།
en: with palms joined, spoke these verses:

source: ཆོས་ འདི་ གནོད་པ་ མེད་ ཅིང་ རིམས་ནད་ མེད །_།
en: $1044 “ ‘This Dharma is free of injury and pain;

source: རང་བཞིན་ རབ་ ཞི་ ཐེར་ཟུག་ འཆི་མེད་ ཞི །_།
en: Its nature is peace—permanent, deathless peace.

source: རབ་ འབྱུང་ བདེ་བ་ ཀུན་ གྱི་ རྩ་བ་ ལགས །_།
en: Going forth is the root of all joy.

source: སྐྱབས་ མཆིས་ སངས་རྒྱས་ བསྟན་ ལ་ རབ་ཏུ་ འབྱུང་ །_།
en: I will go forth in the Buddha’s teaching.

source: བདག་ གིས་ རྒྱལ་སྲིད་ དེ་བཞིན་ ལོངས་སྤྱོད་ དང་ །_། ཆུང་མ་ སྡུག་ དང་ ལོངས་སྤྱོད་ གཉེན་ རྣམས་ བཏང་ །_།
en: $1045 “ ‘I will abandon the kingdom and its enjoyments, My beloved wives and dear relatives.

source: འདོད་པ འི་ ལོངས་སྤྱོད་ དག་ ལ་ ཆོག་ མ་ མཆིས །_།
en: There is no satiation with sensuous pleasures—

source: ངན་པ འི་ ཆོས་ ལ་ རྟག་པ འི་ དུས་ མ་ མཆིས །_།
en: Negative phenomena do not last.

source: བདག་ གིས་ ལོངས་སྤྱོད་ སྣ་ཚོགས་ ཡིད་ མཆི་ སྤྱད །_། |#| དེ་ ནི་ བྱིས་པ་ བློ་ ཆུང་ སྤྱོད་ཡུལ་ ཏེ །_།
en: $1046 “ ‘My mind has gravitated toward the plethora of enjoyments, An experience for small-minded children.

source: རྒྱལ་བས་ བསྔགས་པ འི་ ཆོས་ དེ་ སྤྱད་ བགྱིས་ ན །_།
en: But if I practice the Dharma praised by the Victorious One,

source: སྡུག་བསྔལ་ ཀུན་ གྱི་ མཐའ་མ ར་ བགྱིད་པ ར་ འགྱུར །_།
en: I will bring an end to all suffering.

source: དགེ་སློང་ དགེ་འདུན་ ཐབས་ཅིག་ ལོངས་སྤྱོད་ དུ །_། བདག་ གིས་ རྒྱལ་ [127b] བ འི་ ཐད་ དུ་ རྒྱལ་སྲིད་ བཏང་ །_།
en: $1047 “ ‘I will give up the kingdom to the Victorious One, To enjoy together with the assembly of monks. [127.b]

source: རབ་ཏུ་ འབྱུང་བ ར་ གསོལ་ ཞིང་
en: I beg to go forth;

source: ཀུན་ དུ་ སྤྱད །_། |#| རྐང་ གཉིས་ རྣམས་ ཀྱི་ དམ་པ་ སངས་རྒྱས་ བགྱི །_།
en: practicing it fully, I will become a buddha, the best of humans.

source: མི་ རྣམས་ ཀྱི་ ནི་ རྒྱ་ ཆེན་ དོན་ བགྱི་ ཞིང་ །_། སྡུག་བསྔལ་ མང་པོ ས་ གཟིར་བ འི་ སེམས་ཅན་ དགྲོལ །_།
en: $1048 “ ‘I will perform vast benefit for the sake of people, And free beings afflicted with much suffering.

source: མི་ ཁོམ་ རྒྱ་ ཆེན་ རྣམ་པར་ སྤངས་ ནས་ སུ །_།
en: Having renounced vastly unfortunate states,

source: བདག་ གིས་ ཁོམ་ དང་ མྱ་ངན་ འདས་ ཞི་ ཐོབ །_།
en: I will obtain fortunate states and the peace of nirvāṇa.’

source: དེ་ ལ་ བདེ་བ འི་ རྒྱལ་པོས་ ཆེད་བརྗོད་ བརྗོད །_།
en: $1049 “Sukharāja replied with the following meaningful expression:

source: ལེགས་ སོ་ རྒྱལ་པོ་ ཆེན་པོ་ རྒྱལ་ཆེན་ སེམས །_།
en: ‘Well done, great royal-minded king!

source: ནམ་ཞིག་ སངས་རྒྱས་ ཡེ་ཤེས་ ཁྱོད་ འདོད་ ན །_།
en: Whenever you should desire the wisdom of awakening,

source: མྱུར་ དུ་ ཚུ ར་ ཤོག་ ལེགས་ འོངས་ མྱུར་ རབ་བྱུང་ །_།
en: You are welcome to come and immediately and promptly enter the order!’

source: དེ་ ཚེ་ རྒྱལ་པོས་ ཐོས་ ནས་ སེམས་ མགུ་ སྟེ །_།
en: $1050 “Having heard that, the king was elated and thought,

source: རྒྱལ་བ འི་ བསྟན་ ལ་ རབ་བྱུང་ ཐོབ་ བྱ་ ཞིང་ །_།
en: ‘May I go forth in the Victorious One’s teaching.

source: རྐང་ གཉིས་ གཙོ་བོ འི་ སངས་རྒྱས་ འགྱུར་བ ར་ བྱ །_།
en: May I become a buddha, the best of humans.

source: དེ་ ཚེ་ བདེ་བ འི་ རྒྱལ་པོས་ བདག་ དབུགས་ འབྱིན །_།
en: Sukharāja has accepted me.’

source: རྒྱལ་བ་ དེ་ ཡིས་ བསྟན་ ལ་ དེ་ རབ་བྱུང་ །_།
en: $1051 “That victorious one allowed him to go forth in the teaching.

source: དེ་ ཚེ་ ཡན་ལག་ བཞི་པ འི་ དམག་ གིས་ བསྐོར །_།
en: Then, accompanied by his fourfold army,

source: དེ་ ཚེ་ ཐེག་པ་ མཆོག་ ལ་ ཐམས་ཅད་ ཞུགས །_།
en: They all embarked on the supreme vehicle, thinking,

source: རྐང་ གཉིས་ རྣམས་ ཀྱི་ དམ་པ་ སངས་རྒྱས་ འགྱུར །_།
en: ‘May we become buddhas, the best of humans.’

source: དེ་ ཚེ་ སངས་རྒྱས་ བསྟན་ ལ་ དེ་ རབ་བྱུང་ །_།
en: $1052 “They then went forth into the Buddha’s teaching.

source: ཆོས་སྤྱོད་ ནས་ ནི་ བཟོད་པ འང་ བསྐྱེད་པ ར་ གྱུར །_།
en: Having practiced the Dharma, they also developed patience.

source: ཚེ་ཟད་ ནས་ ནི་ འཆི་བ འི་ དུས་བྱ ས་ ཏེ །_།
en: When their lives were over and they died,

source: དེ་དག་ ཐམས་ཅད་ མཐོ་རིས་ འཇིག་རྟེན་ སྐྱེས །_།
en: They were all born into the higher realms.

source: བདེ་གཤེགས་ གྲགས་ཆེན་ བྱེ་ ཕྲག་ ཉི་ཤུ་ ཡི །_། འདྲེན་པ འི་ སངས་རྒྱས་ དེ་ ཡི་ སྐབས་ སུ་ བྱུང་ །_།
en: $1053 “They were reborn at the time of a buddha who was a guide To two hundred million renowned blissful ones.

source: ཐམས་ཅད་ དེ་དག་ ཀུན་ གྱིས་ མཉེས་པ ར་ བྱས །_། |#| བསྟན་པ་ ཀུན་ ལ འང་ ཆོས་ ནི་ སྤྱད་པ ར་ གྱུར །_།
en: They served them all, And practiced the Dharma according to all their teachings.

source: རྟག་པ ར་ རྒྱུན་ དུ་ བརྩོན་འགྲུས་ བརྩམས་པ ར་ གྱུར །_།
en: $1054 “They applied diligence constantly and continuously, And,

source: ཤེས་རབ་ སྟོབས་ དང་ ལྡན་པ ས་ མི་ འཇིགས་ པ །_། མི་ རྣམས་ ཀྱི་ ནི་ རྒྱ་ ཆེན་ དོན་ བྱས་ ཤིང་ །_། དེ་དག་ གིས་ ནི་ སྲོག་ཆགས་ བྱེ་ སྟོང་ བཀྲོལ །_།
en: unafraid due to their powerful insight, They performed vast benefit for people And freed billions of beings.

source: བདེ་བ ར་ གཤེགས་པ ས་ ཆོས་ བརྗོད་ བཟུང་ ནས་ སུ །_། དེ་དག་ འདྲེན་པ འི་ རྒྱལ་བ་ རྣམས་ སུ་ བྱུང་ །_།
en: $1055 “Upholding the Dharma taught by the blissful ones, They became victorious ones capable of guiding beings, [And spread the teaching, Giving away their bodies, and even their lives.]

source: དེ་དག་ གིས་ ནི་ བསྟན་པ་ རྒྱས་པ ར་ མཛད །_། |#| ལུས་ རྣམས་ བཏང་ ཞིང་ དེ་བཞིན་ སྲོག་ ཀྱང་ བཏང་ །_།
en: [$1055 “Upholding the Dharma taught by the blissful ones, ]They [became victorious ones capable of guiding beings, And ]spread the teaching, Giving away their bodies, and even their lives.

source: ཐེག་པ་ མཆོག་ ལ་ སུ་ཞིག་ འཇུག་ མི་ བྱེད །_། |#| དེ་ ཡི་ རྣམ་པར་ སྨིན་པ་ བླ་མེད་ ཡིན །_།
en: $1056 “They are unexcelled at ripening Whomever cannot be inducted into the supreme vehicle.

source: ཡེ་ཤེས་ བླ་ ན་ མེད་པ་ མཆོག་ཐོབ་ འགྱུར །_།
en: They will attain unexcelled, supreme wisdom,

source: ཞི་བ་ མྱ་ངན་མེད་པ འི་ བྱང་ཆུབ་ རེག _།
en: Reaching the awakening of peaceful nirvāṇa.

source: ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ ཆོས་ དང་ ལྡན་ [128a] པ་ ཆོས་ ཀྱི་ རྒྱལ་པོ་ གང་ གིས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ་ དེ་ ལ་ ལོངས་སྤྱོད་ དུ་ རྒྱལ་སྲིད་ ཕུལ་ ཞིང་ ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ བྱུང་བ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ ཁྱོད་ སོམ་ཉི འམ །_ ཡིད་གཉིས་ ཟ་བ ར་ གྱུར་ ན
en: $1057 “Venerable Śāradvatī­putra, [128.a] if you have any doubt or hesitation, thinking that the righteous Dharma king called King Vīradatta, who at that time offered his kingdom to the blessed thus-gone one Sukharāja for his enjoyment, and went forth from home to homelessness, was someone else,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ཀྱིས་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ འོ །_།
en: do not see it like that, Śāradvatī­putra.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ ང་ ནི་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ དེར་ གྱུར་ ཏོ །_།
en: For I was King Vīradatta.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ཅེས་བྱ་བ་ བྱུང་བ ར་ གྱུར་པ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ ཁྱོད་ སོམ་ཉི འམ་ ཡིད་གཉིས་ ཟ་བ ར་ གྱུར་ ན
en: And, Śāradvatī­putra, if you have any doubt or hesitation, thinking that Prince Puṇyottama was someone else,

source: དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ་ སྟེ །_
en: do not see it like that.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྟན་པ འི་ བླ་ གྲོས་ འདི་ ནི་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ཅེས་བྱ་བར་ གྱུར་ ཏོ །_།
en: For, Śāradvatī­putra, the bodhisattva great being Dṛḍhamati was Prince Puṇyottama.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ ཆོས་ཉིད་ ནི་ སྡུག་བསྔལ་ གྱིས་ གཟིར་བ འི་ སེམས་ཅན་ དག་ མཐོང་ ན་ སྙིང་རྗེ་ ཆེན་པོ་ སྐྱེད་པ ར་ བྱེད་པ འོ །_།
en: $1058 “Śāradvatī­putra, the nature of bodhisattva great beings is to engender great compassion when seeing beings afflicted with suffering.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ ཆོས་ ཟབ་མོ་ ལ་ མངོན་པར་ བརྩོན་པ་ ཡིན །_
en: Moreover, Śāradvatī­putra, bodhisattvas strive for the profound Dharma, [pursue only the profound Dharma, and perfectly teach only the profound Dharma.]

source: ཆོས་ ཟབ་མོ་ ཁོ་ན ར་ ཡོངས་སུ་ ཚོལ་པ་ ཡིན །_
en: [Moreover, Śāradvatī­putra, bodhisattvas strive for the profound Dharma, ]pursue only the profound Dharma, and [perfectly teach only the profound Dharma.]

source: ཆོས་ ཟབ་མོ་ ཁོ་ན་ ཡང་ དག་ པར་ རབ་ཏུ་ སྟོན་པ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: [Moreover, Śāradvatī­putra, bodhisattvas strive for the profound Dharma, pursue only the profound Dharma, and ]perfectly teach only the profound Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གང་ ལ་ བརྟན་པ་ རྣམས་ འགྲོ་བ འི་ ཆོས་ ཟབ་མོ་ དེ་དག་ ནི་ གང་ཡིན །_
en: Śāradvatī­putra, what are the profound dharmas in which they become stable?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བརྟན་པ་ དེ་དག་ ནི་ གང་ཡིན་ ཞེ་ན །_
en: And what, Śāradvatī­putra, is their stability?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ ནི་ བརྟན་པ་ ཞེས་ བྱ་ སྟེ །_
en: Śāradvatī­putra, bodhisattvas are called stable because

source: དེ་དག་ ནི་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ལས་ སྐྱོ་བ ར་ མི་ འགྱུར་ ཞིང་ སྒྱིད་ལུག་ པར་ མི་ འགྱུར་ རོ །_།
en: they do not become discouraged or despondent about unexcelled and perfect awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་དག་ ནི་ བརྟན་པ་ དག་ ཅེས་ བྱ་ སྟེ །_ |#| དེ་དག་ ནི་ ཆོས་ རྣམས་ འཛིན་པ འོ །_།
en: Śāradvatī­putra, when it is said that they are stable, it is because they grasp the dharmas.

source: ཆོས་ གང་དག་ འཛིན་ ཅེ་ན །_
en: What dharmas do they grasp?

source: མིག་ གིས་ ཆོས་ འཛིན་པ ར་ བྱེད་ དོ །_།
en: Dharmas can be grasped with the eyes;

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ གང་ མིག་འཛིན་པ་ དེ་ ནི་ ཆོས་མ་ ཡིན་ ཏེ །_ |#| དེ་ ནི་ གཟུང་ དུ་ མེད་པ འོ །_།
en: but, Śāradvatī­putra, what the eyes grasp is not dharmas, which are not something held.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ ཀྱང་ གང་ཞེ་ན །_
en: What, then, is the Dharma, Śāradvatī­putra?

source: རང་བཞིན་ གྱིས་ ནང་ ན་ ཡང་ མེད །_ |#| ཕྱི་རོལ་ ན་ ཡང་ མེད །_
en: It is by nature neither inside, nor outside.

source: བདག་ ཀྱང་ མེད །_ |#| བདག་ གི་ ཡང་ མེད །_
en: It has neither a self, nor does it belong to a self.

source: ཀུན་ ནས་ ཉོན་མོངས་པ་ ཡང་ མེད །_ |#| རྣམ་པར་ [128b] བྱང་བ་ ཡང་ མེད་པ འོ །_།
en: It has neither affliction, nor purification. [128.b]

source: རྣ་བ་ དང་ །_ སྣ་ དང་ །_ ལྕེ་ དང་ །_ ལུས་ དང་ །_ ཡིད་ ཀྱིས་ ཆོས་ འཛིན་ ཏེ །_
en: Dharmas are grasped by the ears, nose, tongue, body, and mind, but

source: དེ་ ལ་ ཆོས་ གང་ཡིན་པ་ དེ་ ནི་ ཡིད་ མ་ ཡིན་ ནོ །_།
en: in that respect, what the dharmas are is not the mind and so forth.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ ཞེས་ བྱ་བ་ ནི་ གང་ བདག་མེད་པ་ དང་ །_ བདག་ གི་ མེད་པ་ དང་ །_ ཕྱི་རོལ་ མེད་པ་ དང་ །_ ནང་ མེད་པ་ དང་ །_ ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ དང་ །_ རྣམ་པར་ བྱང་བ་ མེད་པ་ དང་ །_ སྐྱེ་བ་ མེད་པ་ དང་ །_ འགག་པ་ མེད་པ འོ །_།
en: Śāradvatī­putra, Dharma is something that has neither a self, nor does it belong to a self; |#| it has neither inside, nor outside; |#| it has neither affliction, nor purification; |#| it has neither birth, nor cessation.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_
en: Why, Śāradvatī­putra?

source: རང་བཞིན་ དེ་ ཡིན་པ འི་ ཕྱིར་ ཏེ །_
en: Because that is its nature—

source: རང་བཞིན་ གང་ཡིན་པ་ དེ་ ནི་ བྱས་པ་ མེད་ ཅིང་ འགྱུར་བ་ མེད་པ ས །_ དེས་ན་ ཡིད་ ནི་ ཆོས་ ཞེས་ བྱ འོ །_།
en: its nature is not something made, and does not change, and therefore mind is called Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཅིའི་ཕྱིར་ འཛིན་པ་ ཞེས་ བྱ་ ཞེ་ན །_
en: $1059 “Why, Śāradvatī­putra, is grasping so termed?

source: སྟོང་པ་ཉིད་ འཛིན་པ ར་ བྱེད །_ |#| མཚན་མ་ མེད་པ་ དང་ །_ སྨོན་པ་ མེད་པ་ འཛིན་པ ར་ བྱེད །_
en: It enables the grasping of emptiness, and the grasping of signlessness and wishlessness.

source: མི་ དམིགས་པ་ སྨོན་པ་ མེད་པར་ འཛིན་པ ར་ བྱེད་པ་ སྟེ །_ |#| མི་ དམིགས་པ་ ནི་ སྨོན་པ་ མེད་པ འོ །_།
en: It enables the grasping of non-perception as wishlessness, for non-perception is wishlessness.

source: ཤ་ར་དྭ་ ཏི འི་ བུ་ གཞན་ ཡང་ ཆོས་ གང་དག་ ཡིན་པ་ དེ་དག་ ནི་ བསལ་བ་ ཡང་ མེད །_ |#| བཞག་པ་ ཡང་ མེད་པ འོ །_།
en: Moreover, Śāradvatī­putra, dharmas are neither to be removed, nor established.
